README.md
```mermaid
flowchart LR

    app -->|index.tsx|ListingsPage
    app --> AuthPage --> LoginForm & RegisterForm
    app --> ProfilePage
    app -->|"[id].tsx"|ListingPage
    app --> SearchBar

    SearchBar -->|LocationFilter.tsx|LocationFilter
    SearchBar --> DateFilter
    SearchBar --> GuestFilter


    ListingsPage --> ListingList --> ListingCard --> ListingPage

    ListingPage --> ListingInfo
    ListingPage --> Reviews
    ListingPage --> HostInfo

    ProfilePage --> UserInfo
    ProfilePage --> UserListings
    ProfilePage --> UserBookings


```
